src/ExchangePlans/ОбменПартКом83_Сайт_Возвраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<ExchangePlan>
		<Properties>
			<Name>ОбменПартКом83_Сайт_Возвраты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУзла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Входящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исходящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

src/ExchangePlans/ОбменПартКом83_Сайт_Возвраты/Ext/ManagerModule.bsl
Функция Узел(Входящий = Истина) Экспорт
	
	лКлючАлгоритма = "ПланОбмена_ОбменПартКом83_ОбменПартКом83_Сайт_Возвраты_МодульМенеджера_Узел";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ОбменПартКом83_Сайт_Возвраты.Ссылка
	                      |ИЗ
	                      |	ПланОбмена.ОбменПартКом83_Сайт_Возвраты КАК ОбменПартКом83_Сайт_Возвраты
	                      |ГДЕ
	                      |	НЕ ОбменПартКом83_Сайт_Возвраты.ЭтотУзел
	                      |	И (&Входящий
	                      |				И ОбменПартКом83_Сайт_Возвраты.Входящий
	                      |			ИЛИ НЕ &Входящий
	                      |				И ОбменПартКом83_Сайт_Возвраты.Исходящий)");
	Запрос.УстановитьПараметр("Входящий", Входящий);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, ПланыОбмена.ОбменПартКом83_Сайт_Возвраты.ПустаяСсылка());
	
КонецФункции
